{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/configurationEditingMain": {
			"cwd": "O directorio de traballo do executor da tarefa no arranque",
			"defaultBuildTask": "O nome da tarefa de compilación predeterminada. Se non hai unha única tarefa de compilación predeterminada mostrase unha selección rápida para elixir a tarefa de compilación.",
			"file": "O arquivo aberto actualmente",
			"fileBasename": "Nome base do arquivo aberto actual ",
			"fileBasenameNoExtension": "Nome base do arquivo aberto actual sen extensión de arquivo ",
			"fileDirname": "Nome do directorio do arquivo aberto actual",
			"fileExtname": "Extensión do arquivo aberto actualmente",
			"lineNumber": "O número de líña seleccionado actual no arquivo activo",
			"pathSeparator": "Carácter que usa o sistema operativo para separar os componentes nas rutas de acceso dos arquivos",
			"relativeFile": "O arquivo aberto actualmente relativo a ${workspaceFolder}",
			"relativeFileDirname": "Nome de directorio do arquivo aberto actual en relación con ${workspaceFolder}",
			"selectedText": "O texto actual seleccionado no arquivo activo ",
			"workspaceFolder": "A ruta do cartafol aberta en VS Code",
			"workspaceFolderBasename": "O nome de la cartafol aberta en VS Code sen ningunha barra diagonal (/)"
		},
		"dist/extensionsProposals": {
			"exampleExtension": "Exemplo"
		},
		"dist/settingsDocumentHelper": {
			"activeEditor": "Utilice o idioma do editor de texto actualmente activo, se existe",
			"activeEditorLong": "a ruta de acceso completa do arquivo (por Exemplo, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"activeEditorMedium": "a ruta de acceso de arquivo relativa ao cartafol de área de traballo (p. ex. myFolder/myFileFolder/myFile.txt)",
			"activeEditorShort": "o nome do arquivo (por Exemplo omeuarquivo.txt)",
			"activeFolderLong": "a ruta completa do cartafol que conten o arquivo (por Exemplo, /Users/Development/myFolder/myFileFolder)",
			"activeFolderMedium": "a ruta do cartafol que conten o arquivo, relativa ao cartafol da área de traballo (por Exemplo myFolder/myFileFolder)",
			"activeFolderShort": "o nome do cartafol no que se atopa o arquivo (por Exemplo, myFileFolder)",
			"appName": "p. ex. VS Code",
			"assocDescriptionFile": "Asigna todos os arquivos do nome coincide co patrón global a linguaxe co identificador especificado.",
			"assocDescriptionPath": "Asigna todos os arquivos a ruta de acceso a linguaxe co identificador especificado coincide co patrón global da ruta de acceso absoluta.",
			"assocLabelFile": "arquivos con extensión",
			"assocLabelPath": "arquivos con ruta de acceso",
			"derivedDescription": "Facer coincidir arquivos que teñen elementos do mesmo nivel co mesmo nome pero con extensión diferente.",
			"derivedLabel": "arquivos con elementos do mesmo nivel por nome",
			"dirty": "un indicador con modificacións se o editor activo ten modificacións",
			"falseDescription": "Deshabilitar o patrón.",
			"fileDescription": "Facer coincidir todos os arquivos que teñan unha extensión de arquivo determinada.",
			"fileLabel": "arquivos por extensión",
			"filesDescription": "Facer coincidir todos os arquivos con calquera das extensións de arquivo.",
			"filesLabel": "arquivos con varias extensións",
			"folderDescription": "Facer coincidir un cartafol cun nome determinado en calquera ubicación.",
			"folderLabel": "cartafol por nome (calquera ubicación)",
			"folderName": "nome do cartafol da área de traballo na que o arquivo está contido (p. ej. myFolder)",
			"folderPath": "ruta de acceso de arquivo de la cartafol del área de traballo en la que el arquivo está contido (p. ex. /Users/Development/myFolder)",
			"languageSpecificEditorSettings": "Configuración do editor específica da linguaxe",
			"languageSpecificEditorSettingsDescription": "Reemplazar configuración do editor para linguaxe",
			"remoteName": "por exemplo, SSH",
			"rootName": "nome da área de traballo (p. ex. myFolder o myWorkspace)",
			"rootPath": "ruta do arquivo da área de traballo (p. ej. /Users/Development/myWorkspace)",
			"separator": "un separador condicional (\"-\") que aparece só cando está rodeado de variables con valores",
			"siblingsDescription": "Facer coincidir arquivos que teñen elementos do mesmo nivel co mesmo nome pero con extensión diferente.",
			"topFolderDescription": "Facer coincidir un cartafol de nivel superior con un nome específico.",
			"topFolderLabel": "cartafol por nome (nivel superior)",
			"topFoldersDescription": "Facer coincidir varios cartafoles de nivel superior.",
			"topFoldersLabel": "cartafoles con varios nomes (nivel superior)",
			"trueDescription": "Habilitar o patrón."
		},
		"package": {
			"description": "Proporciona características (IntelliSense avanzado, corrección automática) en arquivos de configuración, como arquivos de valores, de inicio e de recomendación de extensións. ",
			"displayName": "Edición de configuración"
		}
	}
}